In [2]:
import pandas as pd

# Through Dictionary datatypes

In [3]:
data={'id':[100,102],'name':['anu','ayisha'],'mark':[230,280]}
data=pd.DataFrame(data)

In [6]:
data

    id    name  mark
0  100     anu   230
1  102  ayisha   280

In [4]:
data['id']

0    100
1    102
Name: id, dtype: int64

In [5]:
data['name']

0       anu
1    ayisha
Name: name, dtype: object

In [9]:
data[['name','id']]

     name   id
0     anu  100
1  ayisha  102

In [6]:
data=[(1,'ayisha',200),(2,'anu',320),(3,'achu',560)]

In [7]:
data=pd.DataFrame(data,columns=['id','name','mark'])

In [8]:
data

   id    name  mark
0   1  ayisha   200
1   2     anu   320
2   3    achu   560

# Through List of Dictionary

In [9]:
data=[{'id':101,'name':'ayisha','mark':230},{'id':102,'name':'arun','mark':300}]

In [10]:
data=pd.DataFrame(data)

In [11]:
data

    id    name  mark
0  101  ayisha   230
1  102    arun   300

# Through CSV file

In [12]:
# data=pd.read_csv('employee.csv',skiprows=2)
# data=pd.read_csv('employee.csv',header=3)
data=pd.read_csv('employee.csv',header=None,names=['emp_id','emp_name','salary'])
data=pd.read_csv('employee.csv',nrows=3)

FileNotFoundError: [Errno 2] No such file or directory: 'employee.csv'

In [32]:
data

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000
2    3     manu    3000

In [21]:
data=pd.read_csv(r'C:\Users\hp\Desktop\Dataset\heart.csv')

In [33]:
data={'T_id':[100,101,102],'T_Dep':["BCA","BTEC","MCA"],'Salary':[20000,30000,40000]}

In [34]:
data=pd.DataFrame(data)

In [35]:
data

   T_id T_Dep  Salary
0   100   BCA   20000
1   101  BTEC   30000
2   102   MCA   40000

# Converting dataframe to csv

In [44]:
data.to_csv('teachers_details.csv',index=False,columns=['T_id',"Salary"])

In [42]:
data.to_csv(r"C:\Users\hp\Downloads\teachers_details.csv")

# Through excel file

In [55]:
data=pd.read_excel('emp.xlsx',header=None,names=['id','name'])
# data=pd.read_excel('emp.xlsx',skiprows=2)
# data=pd.read_excel('emp.xlsx',header=2)
data=pd.read_excel('emp.xlsx',nrows=2)

In [56]:
data

   1  arun
0  2  achu
1  3  appu

In [57]:
data=[(1,'anu',23),(2,'arun',23),(3,'appu',20)]

In [58]:
data=pd.DataFrame(data,columns=['id','name','age'])

In [59]:
data

   id  name  age
0   1   anu   23
1   2  arun   23
2   3  appu   20

In [64]:
data.to_excel(r'C:\Users\hp\Downloads\sample2.xlsx',sheet_name="details",index=False)

In [65]:
data.to_excel(r'C:\Users\hp\Desktop\samples.xlsx',columns=['age'])